05TJunctionGasWithBaffleMembraneAndSHM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol           0.1;
    }

    pFinal
    {
        $p;
        tolerance        1e-10;
        relTol           0.0;
    }

    h
    {
        //solver          PBiCGStab;
        //preconditioner  DILU;
        
        solver          GAMG; //smoothSolver;
        smoother        GaussSeidel;
        
        tolerance       1e-7;
        relTol          0.1;        
    }

    hFinal
    {
        $h;
        tolerance       1e-9;
        relTol          0.0;
    }
    
    Yi
    {
        //solver          PBiCGStab;
        //preconditioner  DILU;
        
        solver          GAMG; //smoothSolver;
        smoother        GaussSeidel;
        
        tolerance       1e-7;
        relTol          0.0;        
    }    
    
    YiFinal
    {
        $h;
        tolerance       1e-8;
        relTol          0.0;
    }    

    U
    {
        //solver          PBiCGStab;
        //preconditioner  DILU;
        
        solver          GAMG; //smoothSolver;
        smoother        GaussSeidel;
        
        tolerance       1e-7;
        relTol          0.1;        
    }

    UFinal
    {
        $U;
        tolerance       1e-9;
        relTol          0.0;
    }    
    
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors    1;
}

// ************************************************************************* //
